export default {
    "200": "成功",
    "400": "用户不存在",
    '401': '认证失败，无法访问系统资源',
    '402': '验证码错误',
    '403': '当前操作没有权限',
    '404': '访问资源不存在',
    '405': '请求方式不支持',
    '406': '请求参数错误',
    '407': '验证码失效',
    "500": "服务器内部错误",
    "4001": '用户名已存在',
    "4002": '密码错误',
    '800': '二维码过期',
    '801': '等待扫码',
    '802': '待确认',
    '803': '授权登录成功',
    'default': '系统未知错误，请反馈给管理员'
}
export type ErrorCode = 400 | 401 | 403 | 402 | 404 | 405 | 406 | 407 | 500 | 800 | 801 | 802 | 803 | 'default'| 4001 | 4002;
export type NormalCode = 200
// export type ErrorCodeMap = { [key in ErrorCode]: string }